import sys

# Введення розміру трикутника
rows_num = int(input("Введіть розмір трикутника (висота): "))
lst = []

# Введення символу-заповнювача
filler = input("Введіть символ-заповнювач: ")

# Перевірка на кількість символів-заповнювачів
if len(filler) != 1:
    if len(filler) == 0:
        print("Не введено символ-заповнювач")
    else:
        print("Забагато символів-заповнювачів")
    sys.exit(1)

# Створення та виведення трикутника, що дивиться вправо
for i in range(1, rows_num + 1):
    # Виведення пробілів для центрування зліва
    print(" " * (rows_num - i), end="")
    # Виведення символів
    print((filler + " ") * i)
